src/tests/Fixtures/placeorder_sim_only_epp.json

{
    "oneTimeCardToken": null,
    "config": {
        "app_id": 3,
        "redirect_url": "https://0.0.0.0/api/true/success",
        "device": "web",
        "in_page": 1
    },
    "store_detail": [
        {
            "store_id": "L941527",
            "seller_id": 1105904,
            "store_user": "truemovehsim",
            "seller_name": "Test TruemoveH Sim",
            "store_name": "True Store",
            "address": "123",
            "phone": "0123456789",
            "email": "niti.tot@ascendcorp.com",
            "category_id": 3366
        }
    ],
    "payment_detail": {
        "company": "wetrust",
        "currency_code": "THB",
        "discount": 0,
        "com_vat": 2,
        "com_ship_fee": 1.11,
        "method": "NOPAYMENT",
        "total": 0,
        "payment_amount": 0
    },
    "shipping_detail": {
        "company": "Custom",
        "method": "WeMall",
        "weight_unit": "kg",
        "price": 0
    },
    "customer_detail": {
        "id": 0,
        "group_id": 1,
        "type": "email",
        "fax": null,
        "ip": "127.0.0.1",
        "customer_note": null,
        "first_name": "กิกิ",
        "last_name": "วิชช์",
        "email": "mc.qatesting01@gmail.com",
        "telephone": "0647016834"
    },
    "delivery_address": {
        "district_id": "5632",
        "city_id": "721",
        "province_id": "59",
        "country_id": 209,
        "postcode": "75000",
        "firstname": "กิกิ",
        "lastname": "วิชช์",
        "phone": "0647016834",
        "email": "mc.qatesting01@gmail.com",
        "address1": "112/44 ไทยคู่ฟ้า",
        "address2": "-",
        "useIdForm": "true",
        "district": "แม่กลอง",
        "city": "เมืองสมุทรสงคราม",
        "province": "สมุทรสงคราม",
        "country": "ประเทศไทย",
        "branch": "-",
        "company": "-",
        "first_name": "-",
        "last_name": "-"
    },
    "address_location": {
        "lat": "",
        "lng": ""
    },
    "billing_address": {
        "firstname": "กิกิ",
        "lastname": "วิชช์",
        "address1": "112/44 ไทยคู่ฟ้า",
        "address2": "-",
        "district_id": "5632",
        "city_id": "721",
        "province_id": "59",
        "postcode": "75000",
        "country_id": 209,
        "phone": "0647016834",
        "email": "mc.qatesting01@gmail.com",
        "district": "แม่กลอง",
        "city": "เมืองสมุทรสงคราม",
        "province": "สมุทรสงคราม",
        "country": "ประเทศไทย",
        "branch": "-",
        "company": "-",
        "first_name": "-",
        "last_name": "-"
    },
    "products": [
        {
            "product_id": "L91587234",
            "inventory_id": "3078353",
            "quantity": "1",
            "store_id": "L941527",
            "sim_meta": [
                {
                    "number": "0968730575",
                    "sim_type": "postpaid",
                    "product_info": {
                        "product_id": "91587234",
                        "product_type": "sim",
                        "propo_code": "0099973",
                        "store_id": "L941527",
                        "inventory_id": "3078353"
                    },
                    "price_plan": {
                        "id": "9515",
                        "name": "5G Ultra Max Speed 399, Voice150min, Net 5GB",
                        "code": "SMRTFP71",
                        "external_code": "SMRTFP71",
                        "description": "5G Ultra Max Speed 399, Voice150min, Net 5GB",
                        "sim_type": "postpaid",
                        "price": "399",
                        "recommended": "1",
                        "proposition_nas_code": "0099973",
                        "proposition_term_short": "CP Employee Double Net F&F",
                        "campaign_code": "CN624",
                        "company_code": "RM",
                        "proposition_amdoc": "RMV000000025545"
                    },
                    "is_verify": "true",
                    "thai_id": "1250100302781",
                    "verify_time": "2022-01-06 12:12:08",
                    "birth_date": "10/05/1995",
                    "user_information": {
                        "thai_id": "1250100302781",
                        "title": "miss",
                        "first_name": "กิกิ",
                        "last_name": "วิชช์",
                        "thai_id_expire_day": "09",
                        "thai_id_expire_month": "09",
                        "thai_id_expire_year": "2029",
                        "email": "mc.qatesting01@gmail.com",
                        "telephone": "0647016834",
                        "address": "112/44 ไทยคู่ฟ้า",
                        "province": "สมุทรสงคราม",
                        "district": "เมืองสมุทรสงคราม",
                        "sub_district": "แม่กลอง",
                        "zip_code": "75000",
                        "billing_address": {
                            "address": "112/44 ไทยคู่ฟ้า",
                            "province": "สมุทรสงคราม",
                            "district": "เมืองสมุทรสงคราม",
                            "sub_district": "แม่กลอง",
                            "zip_code": "75000"
                        },
                        "invoice_address_type": "other_address",
                        "iden_type": "I"
                    },
                    "sim_image": "https://dummyimage.com/800/ff0000/ffffff.png&text=Package+Image",
                    "campaign_type": "sim_only_epp",
                    "correlation_id": "e1d784ef-ff46-484a-9e42-be66eb86a843",
                    "dealer_code": "80100112",
                    "sim_info": {
                        "proposition_amdoc": "RMV000000025545",
                        "proposition_rms": "029",
                        "product_name": "SIM,STD,TMH ONLINE STORE MULTI",
                        "discount": "36",
                        "discount_code": "DISCOUNT_SIMONLY",
                        "other_pay_amount_code": "45M",
                        "other_pay_amount": "13"
                    },
                    "ekyc_hash": "613439ef-73bf-4b65-b2d1-805e59cd582b",
                    "sim_family_info": {
                        "hdr_cp_fan_emp_thai_id": "1250100302781",
                        "hdr_cp_fan_emp_id": "0994464",
                        "hdr_cp_fan_company_group": "CP ALL"
                    },
                    "advance_payment": "0",
                    "contract": "0"
                }
            ],
            "sku": "3000085736",
            "promotion": [],
            "cost_price": 0,
            "compare_at_price": 49,
            "image_url": "https://cdn-img.wemall-dev.com/941527/w_1400,h_1400,c_thumb/328f1820270c77c130f170785febdbca/5458c7515318e9326156ecb0694df7b0.jpg",
            "warehouse_code": "TH3846",
            "is_freebie": false,
            "has_freebie": false,
            "freebies": [],
            "has_verify": 0,
            "warehouse_sku": "200011194911",
            "weight": 1,
            "prepare_ship_time": 3,
            "category_id": 1972,
            "category_name": "ซิม",
            "com_fee_percent": 0,
            "title": "4G+ Unlimited SIM รายเดือน",
            "option": "ประเภท: Multi ",
            "shipprice_peritem": 0,
            "discount": 0,
            "flashsale": 0,
            "campaign_fee_percent": 0,
            "com_discount_price": 0,
            "images": "https://cdn-img.wemall-dev.com/941527/w_1400,h_1400,c_thumb/328f1820270c77c130f170785febdbca/5458c7515318e9326156ecb0694df7b0.jpg",
            "stock_type": "MF",
            "meta": "",
            "price": 0,
            "final_price": 0,
            "product_type": "sim"
        }
    ],
    "promotions": [],
    "summaries": [
        {
            "code": "sub_total",
            "title": "Sub-Total",
            "value": 0,
            "meta": "meta"
        },
        {
            "code": "total",
            "title": "Total",
            "value": 0,
            "meta": ""
        }
    ],
    "section": "wemall",
    "channel": "TMH-Website",
    "employee_code": ""
}